espressif/esp-mqtt/test/host_test/sdkconfig.defaults
CONFIG_IDF_TARGET="linux"
CONFIG_COMPILER_CXX_EXCEPTIONS=y
CONFIG_COMPILER_CXX_RTTI=y
CONFIG_COMPILER_CXX_EXCEPTIONS_EMG_POOL_SIZE=0
CONFIG_UNITY_ENABLE_IDF_TEST_RUNNER=n
CONFIG_GCOV_ENABLED=y
